---
kind: other
id: Properties.T:Autodesk.Revit.DB.Architecture.NonContinuousRailStructure
source: html/cc491e72-f7fb-08cf-a327-189f88bf3692.htm
---
# NonContinuousRailStructure Properties

Specifies whether the .NET object represents a valid Revit entity.